# -*- org-export-babel-evaluate: t; org-link-file-path-type: relative;-*-
#+TITLE: Annotator Supreme
#+LANGUAGE: en 
#+STARTUP: indent
#+STARTUP: logdrawer hideblocks
#+SEQ_TODO: TODO INPROGRESS(i) | DONE DEFERRED(@) CANCELED(@)
#+TAGS: ignore(i) DEPRECATED(d) noexport(n) export(e)
#+OPTIONS: ^:{} H:3 author:nil todo:nil tags:nil
#+PROPERTY: header-args :cache no :eval never-export

A server to annotate and provide computer vision datasets

* Table of Contents                                            :noexport:TOC:
- [[#getting-started][Getting Started]]
  - [[#cassandra-docker][Cassandra docker]]
  - [[#annotator-supreme-in-docker-container][Annotator Supreme in docker container]]

* Getting Started  

Supreme annotator uses a Cassandra database to store the datasets.

** Cassandra docker 

Get the cassandra docker
#+begin_src sh :results output :exports code
docker pull cassandra 
#+end_src

#+RESULTS:
: Using default tag: latest
: latest: Pulling from library/cassandra
: Digest: sha256:afe579efbad590ac59992b2984d9010184e2f5c1e24e5f1107dde7dd74fd7913
: Status: Image is up to date for cassandra:latest

Run the cassandra container publishing its exposed ports to localhost. 
#+begin_src sh :results output :exports code
docker run -d --name cassandraDB -p 7000:7000 -p 7001:7001 -p 7199:7199 -p 9042:9042 cassandra:latest
#+end_src

#+RESULTS:
: 785c13e211812e815b138d78d2c513347c717d6153414f5787517727093ac21e

** Annotator Supreme in docker container

*** Build the annotator

#+begin_src sh :results output :exports code
docker build -t annotator_supreme -f Dockerfile .
#+end_src

#+RESULTS:
#+begin_example
Sending build context to Docker daemon  49.32MB
Step 1/12 : FROM meerkatcvonpremise/meerkat_base:latest
 ---> ff041dc8c125
Step 2/12 : ADD requirements.txt /code/
 ---> Using cache
 ---> ce7b95ee5700
Step 3/12 : RUN pip3 install pip --upgrade
 ---> Using cache
 ---> 2f1f1f77859d
Step 4/12 : RUN pip3 install -r /code/requirements.txt
 ---> Using cache
 ---> 611de72d56de
Step 5/12 : ADD server /code/server
 ---> Using cache
 ---> c077063939ef
Step 6/12 : ADD annotator_supreme/ /code/annotator_supreme
 ---> Using cache
 ---> f02469ca54ec
Step 7/12 : ADD run_api.py /code/
 ---> Using cache
 ---> de1df25e587b
Step 8/12 : WORKDIR /code
 ---> Using cache
 ---> a3e38e8926ab
Step 9/12 : RUN cp server/nginx.conf /usr/local/nginx/conf/nginx.conf
 ---> Using cache
 ---> f1622bc0bcbd
Step 10/12 : RUN ln -sf /dev/stdout /usr/local/nginx/logs/access.log
 ---> Using cache
 ---> e2ac8b55f60b
Step 11/12 : RUN ln -sf /dev/stderr /usr/local/nginx/logs/error.log
 ---> Using cache
 ---> 266c2bf21716
Step 12/12 : CMD supervisord -c server/supervisord.conf
 ---> Using cache
 ---> e023f82d8879
Successfully built e023f82d8879
Successfully tagged annotator_supreme:latest
#+end_example

*** Starting the container for annotating 

#+begin_src sh :results output :exports code
docker run -d --env CLUSTER_IP=172.17.0.2 -p 80:80 \
       --add-host=cassandraDB:172.17.0.2 annotator_supreme
#+end_src

#+RESULTS:
: 1f8cae6b18d0daf6650863bd2fe85f6a53fcedcfd48c95fa40bda39bb99d274b

If everything works as expected annotator is serving at [[http://localhost/annotator-supreme/]]

*** TODO Starting for Development

